app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Public Article"], ["body", "This is my first public article"], ["created_at", "2023-01-19 10:28:44.898374"], ["updated_at", "2023-01-19 10:28:44.898374"], ["status", "public"]]