app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "Ahmad "], ["body", "Good Work"], ["article_id", 5], ["created_at", "2023-01-19 10:28:56.202661"], ["updated_at", "2023-01-19 10:28:56.202661"], ["status", "public"]]